Revit 2026 API

# GeometryCreationUtilitiesCreateSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateSweptGeometry(
	CurveLoop sweepPath,
	int pathAttachmentCrvIdx,
	double pathAttachmentParam,
	IList<CurveLoop> profileLoops
)
```
```vb
Public Shared Function CreateSweptGeometry (
	sweepPath As CurveLoop,
	pathAttachmentCrvIdx As Integer,
	pathAttachmentParam As Double,
	profileLoops As IList(Of CurveLoop)
) As Solid
```
```cpp
public:
static Solid^ CreateSweptGeometry(
	CurveLoop^ sweepPath,
	int pathAttachmentCrvIdx,
	double pathAttachmentParam,
	IList<CurveLoop^>^ profileLoops
)
```
```fsharp
static member CreateSweptGeometry :
        sweepPath : CurveLoop *
        pathAttachmentCrvIdx : int *
        pathAttachmentParam : float *
        profileLoops : IList<CurveLoop> -> Solid
```

#### Parameters

sweepPath CurveLoop

pathAttachmentCrvIdx Int32

pathAttachmentParam Double

profileLoops IListCurveLoop

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

CreateSweptGeometry Overload

Autodesk.Revit.DB Namespace